app/controllers/school_classes_controller.rb

    def create
        school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Bio"], ["room_number", 402], ["created_at", "2021-03-13 05:17:02.983804"], ["updated_at", "2021-03-13 05:17:02.983804"]]

    def update
        school_class = SchoolClass.find_by_id(params[:id])
        school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "History"], ["updated_at", "2021-03-13 05:23:44.011324"], ["id", 2]]