app/controllers/students_controller.rb

    def create
        student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "fashi"], ["last_name", "sha"], ["created_at", "2021-03-13 04:46:12.619295"], ["updated_at", "2021-03-13 04:46:12.619295"]]

    def edit
        @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def update
        student = Student.find_by_id(params[:id])
        student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Cafer boyum 1.10"], ["updated_at", "2021-03-13 04:55:30.571069"], ["id", 4]]